package com.xingren.method;

/**
 *1.如果方法的返回类型是void，则表示没有返回值
 * 如果方法的返回类型不是void，则表示有返回值
 *    方法执行结束后有返回值的话，对于调用者来说，可以选择接收，也可以选择不接收
 *2.方法名：只要是合法的标识符即可（首字母小写，后面的每个单词首字母大写）
 * 方法名最好反映了这个方法所实现的功能
 *    注：一般方法都是一个行为，所以方法名一般都是动词
 *3.方法的定义的语法格式：
 * [访问修饰符] 返回值类型 方法名(形式参数列表) {
 *     方法体;
 * }
 *4.形式参数列表一般简称为形参，
 * 形参个数为0到多个，多个的话，用逗号隔开
 * 形参是局部变量，方法执行完毕后，形参就会消失
 * 形参中起决定作用的是形参的类型和个数
 * 形参名随意，但也要见名知意
 *5.方法体：任何一个方法都有一个方法体，方法体用大括号括起来
 * 在大括号中编写"java语句;"
 * 并且方法体中的代码是有执行顺序的，遵循自上而下
 *6.方法的调用
 * 当这个方法的修饰符有static关键字的时候：
 *    调用格式：类名.方法名(实参);
 * 实际参数列表简称为实参
 * 形参和实参要一一对应：
 *    形参和实参的个数一一对应
 *    形参和实参的类型一一对应
 *
 *
 */
public class MethodDemo03 {
    public static void main(String[] args) {
        //用完整语法调用一次方法
        int result = MethodDemo03.add(10, 20);
        System.out.println(10 + "+" + 20 + "=" + result);

    }

    public static int add(int a ,int b){
        return a + b;
    }
}
